# UDEMY MySQL Bootcamp Course

Completed Section 1 of Course May 20th, 2021

Signed up for GOORM IDE and created new workspace for course May 23, 2021

Completed Section 2 of Course May 23, 2021

Completed Lecture Videos Section 3 # 17-26 May 23, 2021

Lecture 27 - Basic Data Types Challenge
    Draw a Tweets Table
        - A username (max 15 characters)
        - The Tweet Content (max 140 characters)
        - Number of Favorites
    My_Tweet_Table
        - username varchar(15)
        - Content varchar(140)
        - Favorites int
    Solution
        - username varchar(15)
        - Content varchar(140)
        - Favorites int
    Challege is Correct
    Challenge Completed May 23, 2021

Completed Lecture Videos Section 3 # 29-34 May 23, 2021

Lecture 35 - Creating Your Own Tables Challenge
    Pastries Table
        - Should atleast include columns name (50 characters max) and quantity
        - Inspect your table/columsn in cli
        - Delete the table

In [1]:
# Lecture 35 Challenge
# CREATE TABLE pastries(
#    -> name VARCHAR(50),
#    -> number INT,
#    -> price INT
#    -> );
# SHOW TABLES;
# SHOW COLUMNS FROM pastries;
# DROP TABLE pastries;
# SHOW TABLES;

In [2]:
# Lecture 35 Solution
# CREATE TABLE pastries
#   (
#     name VARCHAR(50),
#     quantity INT
#   );
 
# SHOW TABLES;
 
# DESC pastries;
 
# DROP TABLE pastries;
# Slight syntax difference between work and solution. Still correct.
# Completed Lecture 35 Code Challenge May 23, 2021

Completed Section 3 May 23, 2021

Completed Lecture Videos Section 4 # 37-43 May 25th, 2021

In [1]:
# Lecture 44 Challenge
# CREATE TABLE people (
#    -> first_name VARCHAR(20),
#    -> last_name VARCHAR(20),
#    -> age INT
#    -> );
#
# INSERT INTO people(first_name, last_name, age) VALUES('Tina', 'Belcher', 13);
# SELECT * FROM people;
#
# INSERT INTO people(age, first_name, last_name) VALUES (42, 'Bob', 'Belcher');
# SELECT * FROM people;
#
# INSERT INTO people(first_name, last_name, age) VALUES ('Linda', 'Belcher', 45), ('Phillip', 'Frond', 38), ('Calvin', 'F
# ischoeder', 70);
# SELECT * FROM people;

In [2]:
# INSERT CHALLENGE SOLUTION
# CREATE TABLE people
#   (
#     first_name VARCHAR(20),
#     last_name VARCHAR(20),
#     age INT
#   );
# INSERT INTO people(first_name, last_name, age)
# VALUES ('Tina', 'Belcher', 13);
# INSERT INTO people(age, last_name, first_name)
# VALUES (42, 'Belcher', 'Bob');
# INSERT INTO people(first_name, last_name, age)
# VALUES('Linda', 'Belcher', 45)
#   ,('Phillip', 'Frond', 38)
#   ,('Calvin', 'Fischoeder', 70);
# Slight Difference between work and solution. Still correct.
# Completed Lecture 44 Code Challenge May 28, 2021

Completes Lecture Videos Section 4 # 48 - 56 May 29, 2021

In [1]:
# Lecture 57 CHALLENGE
# CREATE TABLE Employees(
#     -> id INT NOT NULL AUTO_INCREMENT,
#     -> last_name VARCHAR(20) NOT NULL,
#     -> first_name VARCHAR(20) NOT NULL,
#     -> middle_name VARCHAR(20),
#     -> age INT NOT NULL,
#     -> current_status VARCHAR(50) NOT NULL DEFAULT 'employed',
#     -> PRIMARY KEY (id)
#     -> );
#
# INSERT INTO Employees(last_name, first_name, middle_name, age, current_status) VALUES ('Smith', 'John', 'William', 23,
# 'employed')

In [2]:
# Lecture 57 SOLUTION
# CREATE TABLE employees (
#     id INT AUTO_INCREMENT NOT NULL,
#     first_name VARCHAR(255) NOT NULL,
#     last_name VARCHAR(255) NOT NULL,
#     middle_name VARCHAR(255),
#     age INT NOT NULL,
#     current_status VARCHAR(255) NOT NULL DEFAULT 'employed',
#     PRIMARY KEY(id)
# );
#
# Slight Difference in order of words between work and solution. Still Correct.
# Completed May 30th, 2021

Completed Section 4 May 30, 2021

Completed Video Lectures Section 5 # 60-68

In [1]:
# Lecture 69 CHALLENGE
#
# SELECT cat_id FROM cats;
#
# SELECT name, breed FROM cats;
#
# SELECT name, age FROM cats
#    -> WHERE breed = 'Tabby';
#
# SELECT cat_id, age FROM cats
#     -> WHERE cat_id = age;

In [2]:
# Lecture 69 SOLUTION
# SELECT cat_id FROM cats; 

# SELECT name, breed FROM cats; 

# SELECT name, age FROM cats WHERE breed='Tabby'; 

# SELECT cat_id, age FROM cats WHERE cat_id=age; 

# SELECT * FROM cats WHERE cat_id=age; 

# Work is correct. Completed May 31, 2021

Completes Video Lectures Section 5 # 72 - 75

In [1]:
# Lecture 76 CHALLENGE

# UPDATE cats SET name = 'Jack'
#    -> WHERE name = 'Jackson';

# UPDATE cats SET breed = 'British Shorthair'
# -> WHERE name = 'Ringo';

# UPDATE cats SET age = 12
#    -> WHERE breed = 'Maine Coon';

In [2]:
# Lecture 76 SOLUTION

# SELECT * FROM cats WHERE name='Jackson';
 
### UPDATE cats SET name='Jack' WHERE name='Jackson';
 
# SELECT * FROM cats WHERE name='Jackson';
 
# SELECT * FROM cats WHERE name='Jack';
 
# SELECT * FROM cats WHERE name='Ringo';
 
### UPDATE cats SET breed='British Shorthair' WHERE name='Ringo';
 
# SELECT * FROM cats WHERE name='Ringo';
 
# SELECT * FROM cats;

# SELECT * FROM cats WHERE breed='Maine Coon';
 
### UPDATE cats SET age=12 WHERE breed='Maine Coon';
 
# SELECT * FROM cats WHERE breed='Maine Coon';

# Work is correct. Completed May 31, 2021